RhinoInside.Revit API Documentation
ColorConverter Class
 Represents a converter for converting Color values back and forth Revit and Rhino.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Convert.Eto.Drawing.ColorConverter
 Namespace: RhinoInside.Revit.Convert.Eto.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static class ColorConverter
class ColorConverter
Methods
Name | Description
ToColor(Color)
 Converts the specified Color to an equivalent Color.
ToColor(Color)
 Converts the specified Color to an equivalent Autodesk.Revit.DB.Color.
Top
See Also
Reference
RhinoInside.Revit.Convert.Eto.Drawing Namespace